Белгипрозем_2017/src/ExchangePlans/Мобильный/Мобильный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="a0e3f933-b85f-4610-8fcf-7304c1f3b0c1">
  <name>Мобильный</name>
  <comment>План обмена для регистрации изменений данных для конкретных мобильных клиентов</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОписаниеКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

Белгипрозем_2017/src/InformationRegisters/ОчередиСообщенийОбменаСМобильнымиКлиентами/ОчередиСообщенийОбменаСМобильнымиКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередиСообщенийОбменаСМобильнымиКлиентами</name>
  <resources>
    <name>Очередь</name>
    <type>
      <types>CatalogRef.ОчередиСообщенийИнтегрированныхСистем</types>
    </type>
  </resources>
  <dimensions>
    <name>МобильныйКлиент</name>
    <type>
      <types>ExchangePlanRef.Мобильный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОМобильныхКлиентах/СведенияОМобильныхКлиентах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОМобильныхКлиентах</name>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МобильныйКлиент</name>
    <type>
      <types>ExchangePlanRef.Мобильный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/ExchangePlans/Мобильный/ManagerModule.bsl
Функция ПолучитьУзелОбмена(КодМобильногоКлиента, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.Мобильный.НайтиПоКоду(КодМобильногоКлиента); 
	Если УзелОбмена.Пустая() Тогда
		// Регистрация нового мобильного клиента
		УзелОбъект = ПланыОбмена.Мобильный.СоздатьУзел();
        УзелОбъект.Код = КодМобильногоКлиента;
		УзелОбъект.Пользователь = Пользователь;
		УзелОбъект.ДатаСоздания = ТекущаяДатаСеанса();
        УзелОбъект.Записать();
		
		// Создание новой очереди сообщений для нового мобильного клиента
		НоваяОчередь = Справочники.ОчередиСообщенийИнтегрированныхСистем.СоздатьЭлемент();
		НоваяОчередь.Наименование = Строка(Пользователь);
		НоваяОчередь.Записать();
		
		// Привязка новой очереди сообщений и нового мобильного клиента
		МенеджерЗаписиОчередей = РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
		МенеджерЗаписиОчередей.МобильныйКлиент = УзелОбъект.Ссылка;
		МенеджерЗаписиОчередей.Очередь = НоваяОчередь.Ссылка;
		МенеджерЗаписиОчередей.Записать();
		
		УзелОбмена = УзелОбъект.Ссылка;
	КонецЕсли;
			
	Возврат  УзелОбмена;
	
КонецФункции

// Возвращает массив не помеченных на удаление узлов пользователя
Функция ПолучитьВсеУзлыПользователя(Пользователь) Экспорт
	
	ЗапросПолучениеУзлов = Новый Запрос;
	ЗапросПолучениеУзлов.Текст =
		"ВЫБРАТЬ
		|	Мобильный.Ссылка
		|ИЗ
		|	ПланОбмена.Мобильный КАК Мобильный
		|ГДЕ
		|	Мобильный.ПометкаУдаления = ЛОЖЬ
		|	И Мобильный.Пользователь = &Пользователь";
	ЗапросПолучениеУзлов.УстановитьПараметр("Пользователь", Пользователь);
	Возврат ЗапросПолучениеУзлов.Выполнить().Выгрузить().ВыгрузитьКолонку(0);	
	
КонецФункции

Функция ПланОбменаИспользуетсяВМоделиСервиса() Экспорт
	Возврат Ложь;
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Сведения = РегистрыСведений.СведенияОМобильныхКлиентах.ПолучитьСведения(Данные.Ссылка);
		Если Сведения <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1, акт. %2",
				Сведения.Описание,
				Сведения.ДатаПоследнейАктивности);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
